print("Привіт! ")
print("Це невеличка вікторина. За кожну правильну відповідь ти отримуєш 1 бал.")
print("Успіхів!\n")

score = 0

answer1 = input("1. Хто був прем'єр-міністром Великої Британії з 1841 по 1846 рік? ")
if answer1.strip().lower() == "Роберт Піл":
    print("Правильно!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Роберт Піл\n")

answer2 = input("2. Якою була професійна діяльність Аль Капоне, зазначена на його візитній картці ")
if answer2.strip() == 'Продавець вживаних меблів':
    print("Правильно!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь: Продавець вживаних меблів\n")

answer3 = input("3. Яка країна виграла Чемпіонат світу 1982 року в Іспанії, перемігши Західну Німеччину з рахунком 3:1? ")
if answer3.strip().lower() == " Італія":
    print("Правильно!\n")
    score += 1
else:
    print("Неправильно! Правильна відповідь:  Італія\n")

answer4 = input("4.  Хто винайшов грамофон'? ")
if answer4.strip().lower() == "Еміль Берлінер":
    print("Правильно!\n")
    score += 1
else:
    print("Неправильно!  Правильна відповідь: Еміль Берлінер\n")

print("Гру завершено!")
print(f"Твій результат: {score} бал(ів) із 4 можливих.")